"""
██████╗ ██╗███████╗ ██████╗██╗      █████╗ ██╗███╗   ███╗███████╗██████╗
██╔══██╗██║██╔════╝██╔════╝██║     ██╔══██╗██║████╗ ████║██╔════╝██╔══██╗
██║  ██║██║███████╗██║     ██║     ███████║██║██╔████╔██║█████╗  ██████╔╝
██║  ██║██║╚════██║██║     ██║     ██╔══██║██║██║╚██╔╝██║██╔══╝  ██╔══██╗
██████╔╝██║███████║╚██████╗███████╗██║  ██║██║██║ ╚═╝ ██║███████╗██║  ██║
╚═════╝ ╚═╝╚══════╝ ╚═════╝╚══════╝╚═╝  ╚═╝╚═╝╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝

Warning! Profanity words!
By their very nature these lists of swear words contain material many will
find offensive. But that's kind of the point. It's nothing bad to be gay,
it's just kidding. If you think it's outrageous and unacceptable, please
contact to repository owner.


██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗██╗  ██╗
╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝╚██╗██╔╝
 ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝  ╚███╔╝
 ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗  ██╔██╗
██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗██╔╝ ██╗
"""


Gwords = ['gay', 'гей', 'гейство', 'пидр', 'пидор', 'хуй', 'член', 'fap',
          'дрочить', 'хуя', 'хуясе', 'писос', 'dick', 'пидорас', 'ебать',
          'сосать', 'дроч', 'anal', 'анал', 'дырка', 'hole', 'сосу', 'ху'
          ]
whogay = ['whogay', 'whoisgay', 'ктогей']
