MESSAGES = {
    'admin': "Hello, nice to see you. Let's start",
    'banned': "Sorry, you are banned",
    'forwarded': "Media forwarded",
    'done': "Done.",
    'yes': "Yes",
    'no': 'No',
    'ship_success': "Couple of day",
    'ship_fail_1': "New shipping will be available after ",
    'sec': "seconds",
    'min': "minutes",
    'hor': 'hours',
    'and': 'and',
    'nice_day': "Have a nice day!",
    'next_ship': "Next shipping will be available tomorrow",
    'got': 'got',
    'gay_top': 'TOP OF THE MOST GAY PERSONS',
    'ship_top': 'TOP MOST SHIPPED PERSONS',
    'permission_denied': "Permission denied",
    'change_your_nick': "You can change only our own nickname",
    'name_changed_to': ["Name of", "changed to"],
    'not_enough_users': "Недостаточно участников :(",
    'about': """Привет, я GayBot 0.2 👋
    
Это тестовый запуск, поэтому большая часть моего интерфейса ещё не переведена на русский 😅

Вот что доступно уже сегодня:

1. 🏳️‍🌈 GayCoin-ы за ругательства и брань. Напиши “блять”, чтобы проверить. 

2.  📊 Показать топ GayCoin-ов /top или /topN, где N - любое число
 
3. 🗂 Поменять то, как твой ник отображается в моих сообщениях, для этого ответь (reply) на собственное сообщение следующий текст “/name MY_NEW_NAME”, где вместо MY_NEW_NAME будет тот ник, что ты желаешь.

4. 👩‍❤️‍👨 Ежидневный ШИППИНГ, чтобы выбрать пару дня напиши /shipping или просто /s . 
Узнать ШИППЕР-топ /ship_top 


5. 🕶 Администраторы могут менять имена других пользователей командой /name, а так же имеют доступ
"""
}
